// Задача 20: Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
// A (3,6); B (2,1) -> 5,09
// A (7,-5); B (1,-1) -> 7,21

Console.WriteLine("Введите координаты точки по Х");
int X = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите координаты точки по Y");
int y = Convert.ToInt32(Console.ReadLine());

